//【模板】差分
// 题解
// 
// 讨论
// 
// 查看他人的提交
// 
// 我的提交
//
//题号：NC226303
//时间限制：C/C++/Rust/Pascal 1秒，其他语言2秒
//空间限制：C/C++/Rust/Pascal 256 M，其他语言512 M
//64bit IO Format: %lld
//题目描述 
//对于给定的长度为 
//n
//n 的数组 
//{
//a
//1
//,
//a
//2
//,
//…
//,
//a
//n
//}
//{a 
//1
//?
// ,a 
//2
//?
// ,…,a 
//n
//?
// } ，我们有 
//m
//m 次修改操作，每一次操作给出三个参数 
//l
//,
//r
//,
//k
//l,r,k ，代表将数组中的 
//a
//l
//,
//a
//l
//+
//1
//,
//…
//,
//a
//r
//a 
//l
//?
// ,a 
//l+1
//?
// ,…,a 
//r
//?
//  都加上 
//k
//k 。
//请你直接输出全部操作完成后的数组。
//输入描述:
//第一行输入两个整数 
//n
//,
//m
//(
//1
//≦
//n
//,
//m
//≦
//1
//0
//5
//)
//n,m(1≦n,m≦10 
//5
// ) 代表数组中的元素数量、操作次数。
//第二行输入 
//n
//n 个整数 
//a
//1
//,
//a
//2
//,
//…
//,
//a
//n
//(
//?
//1
//0
//9
//≦
//a
//i
//≦
//1
//0
//9
//)
//a 
//1
//?
// ,a 
//2
//?
// ,…,a 
//n
//?
// (?10 
//9
// ≦a 
//i
//?
// ≦10 
//9
// ) 代表初始数组。
//此后 
//m
//m 行，每行输入三个整数 
//l
//,
//r
//,
//k
//(
//1
//≦
//l
//≦
//r
//≦
//n
//;
// 
//?
//1
//0
//9
//≦
//k
//≦
//1
//0
//9
//)
//l,r,k(1≦l≦r≦n; ?10 
//9
// ≦k≦10 
//9
// ) 代表一次操作。
//输出描述:
//在一行上输出 
//n
//n 个整数，代表全部操作完成后的数组。
//示例1
//输入
//复制
//3 2
//1 2 3
//1 2 4
//3 3 -2
//输出
//复制
//5 6 1
//备注:
//在几乎全部的情况下，
//P
//y
//P
//y
//PyPy 的运行速度优于 
//P
//y
//t
//h
//o
//n
//Python ，我们建议您选择对应版本的 
//P
//y
//P
//y
//PyPy 进行提交、而不是 
//P
//y
//t
//h
//o
//n
//Python 。

#include <iostream>

using namespace std;

typedef long long LL;

const int N = 1e5 + 10;

int n, m;
LL f[N];//差分数组

int main()
{
    cin >> n >> m;
    //创建差分数组（利用性质）
    for(int i = 1; i <= n; i++)
    {
        LL x;
        cin >> x;
        f[i] += x;
        f[i + 1] -= x;
    }
    
    //处理m次修改操作
    while(m--)
    {
        LL l, r, k;
        cin >> l >> r >> k;
        f[l] += k;
        f[r + 1] -= k;
    }
    
    //还原出原始的数组
    for(int i = 1; i <= n; i++)
    {
        f[i] = f[i - 1] + f[i];
        cout << f[i] << " ";
    }
    
    return 0;
}
