//【模板】前缀和
// 题解
// 
// 讨论
// 
// 查看他人的提交
// 
// 我的提交
//
//题号：NC226282
//时间限制：C/C++/Rust/Pascal 1秒，其他语言2秒
//空间限制：C/C++/Rust/Pascal 256 M，其他语言512 M
//64bit IO Format: %lld
//题目描述 
//对于给定的长度为 
//n
//n 的数组 
//{
//a
//1
//,
//a
//2
//,
//…
//,
//a
//n
//}
//{a 
//1
//?
// ,a 
//2
//?
// ,…,a 
//n
//?
// } ，我们有 
//m
//m 次查询操作，每一次操作给出两个参数 
//l
//,
//r
//l,r ，你需要输出数组中第 
//l
//l 到第 
//r
//r 个元素之和，即 
//a
//l
//+
//a
//l
//+
//1
//+
//?
//+
//a
//r
//a 
//l
//?
// +a 
//l+1
//?
// +?+a 
//r
//?
//  。
//输入描述:
//第一行输入两个整数 
//n
//,
//m
//(
//1
//≦
//n
//,
//m
//≦
//1
//0
//5
//)
//n,m(1≦n,m≦10 
//5
// ) 代表数组中的元素数量、查询次数。
//第二行输入 
//n
//n 个整数 
//a
//1
//,
//a
//2
//,
//…
//,
//a
//n
//(
//?
//1
//0
//9
//≦
//a
//i
//≦
//1
//0
//9
//)
//a 
//1
//?
// ,a 
//2
//?
// ,…,a 
//n
//?
// (?10 
//9
// ≦a 
//i
//?
// ≦10 
//9
// ) 代表初始数组。
//此后 
//m
//m 行，每行输入两个整数 
//l
//,
//r
//(
//1
//≦
//l
//≦
//r
//≦
//n
//)
//l,r(1≦l≦r≦n) 代表一次查询。
//输出描述:
//对于每一次查询操作，在一行上输出一个整数，代表区间和。
//示例1
//输入
//复制
//3 2
//1 2 4
//1 2
//2 3
//输出
//复制
//3
//6

#include <iostream>

using namespace std;

typedef long long LL;

const int N = 1e5 + 10;

int n, q;
LL a[N];
LL f[N];//前缀和数组

int main()
{
    cin >> n >> q;
    
    for(int i = 1; i <= n; i++) cin >> a[i];
    
    //处理前缀和数组
    for(int i = 1; i <= n; i++)
    {
        f[i] = f[i - 1] + a[i];
    }
    
    //处理q次询问
    while(q--)
    {
        int l, r; cin >> l >> r;
        cout << f[r] - f[l - 1] << endl;
    }
    
    return 0;
}
