//【模板】完全背包
// 题解
// 
// 讨论
// 
// 查看他人的提交
// 
// 我的提交
//
//题号：NC226516
//时间限制：C/C++/Rust/Pascal 1秒，其他语言2秒
//空间限制：C/C++/Rust/Pascal 256 M，其他语言512 M
//64bit IO Format: %lld
//题目描述 
//你有一个背包，最多能容纳的体积是V。
//
//现在有n种物品，每种物品有任意多个，第i种物品的体积为
//v
//i
//v 
//i
//?
//  ,价值为
//w
//i
//w 
//i
//?
// 。
//
//（1）求这个背包至多能装多大价值的物品？
//（2）若背包恰好装满，求至多能装多大价值的物品？
//输入描述:
//第一行两个整数n和V，表示物品个数和背包体积。
//接下来n行，每行两个数
//v
//i
//v 
//i
//?
// 和
//w
//i
//w 
//i
//?
// ，表示第i种物品的体积和价值。
//1
//≤
//n
//,
//V
//≤
//1000
//1≤n,V≤1000
//
//输出描述:
//输出有两行，第一行输出第一问的答案，第二行输出第二问的答案，如果无解请输出0。
//示例1
//输入
//复制
//2 6
//5 10
//3 1
//输出
//复制
//10
//2
//示例2
//输入
//复制
//3 8
//3 10
//9 1
//10 1
//输出
//复制
//20
//0
//说明
//无法恰好装满背包。
//示例3
//输入
//复制
//6 13
//13 189
//17 360
//19 870
//14 184
//6 298
//16 242
//输出
//复制
//596
//189
//说明
//可以装5号物品2个，达到最大价值298*2=596，若要求恰好装满，只能装1个1号物品，价值为189.

#include <iostream>
#include <cstring>

using namespace std;

const int N = 1010;

int n, m;
int v[N], w[N];
int f[N][N];

int main()
{
    cin >> n >> m;
    for(int i = 1; i <= n; i++) cin >> v[i] >> w[i];
    
    //第一问
    for(int i = 1; i <= n; i++)
    {
       for(int j = 0; j <= m; j++)
        {
            f[i][j] = f[i - 1][j];
            if(j >= v[i]) f[i][j] = max(f[i][j], f[i][j- v[i]] + w[i]);
        } 
    }
        
    cout << f[n][m] << endl;
    
    //第二问
    memset(f, -0x3f, sizeof f);
    f[0][0] = 0;
    for(int i = 1; i <= n; i++)
    {
        for(int j = 0; j <= m; j++)
        {
            f[i][j] = f[i - 1][j];
            if(j >= v[i]) f[i][j] = max(f[i][j], f[i][j - v[i]] + w[i]);
        }
        

    }
    if(f[n][m] < 0) cout << 0 << endl;
    else cout << f[n][m] << endl;
    
    return 0;
}
