//链接：https://ac.nowcoder.com/acm/problem/22206
//来源：牛客网
//
//题目描述 
//输出九九乘法表。
//具体的输出格式见样例，其中每一项乘法的结果需要占据2个字符宽度，不同的乘法结果之间用1个空格间隔。
//举例：
//1*4=_4_2*4=_8_3*4=12_4*4=16
//上述语句的每一个 _  都代表一个空格。
//输入描述:
//此题没有输入
//输出描述:
//输出乘法表，对齐方式见样例输出
//示例1
//输入
//复制
//无
//输出
//复制
//1*1= 1
//1*2= 2 2*2= 4
//1*3= 3 2*3= 6 3*3= 9
//1*4= 4 2*4= 8 3*4=12 4*4=16
//1*5= 5 2*5=10 3*5=15 4*5=20 5*5=25
//1*6= 6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
//1*7= 7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
//1*8= 8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
//1*9= 9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81

#include <iostream>
#include <cstdio>
using namespace std;

int main()
{
    for(int i = 1; i <= 9; i++)
    {
        for(int j = 1; j <= i; j++)
        {
            printf("%d*%d=%2d ", j, i, j * i);
        }
        printf("\n");
    }
    
    return 0;
}
