//链接：https://ac.nowcoder.com/acm/problem/22199
//来源：牛客网
//
//题目描述 
//给定一个整数 
//??
//(
//?
//1
//0
//9
//≦
//??
//≦
//1
//0
//9
//)
//n(?10 
//9
// ≦n≦10 
//9
// )，请计算其所有数位之和。若 
//??
//n 为负数，请先取其绝对值。
//输入描述:
//在一行中输入一个整数 
//??
//n，满足 
//?
//1
//0
//9
//≦
//??
//≦
//1
//0
//9
//?10 
//9
// ≦n≦10 
//9
// 。
//输出描述:
//输出一个整数，表示 
//??
//n 的所有数位之和。
//示例1
//输入
//复制
//12
//输出
//复制
//3
//说明
//将正整数 
//12
//12 的各位相加，
//1
//+
//2
//=
//3
//1+2=3。
//示例2
//输入
//复制
//-305
//输出
//复制
//8
//说明
//取绝对值后 
//305
//305 的各位相加，
//3
//+
//0
//+
//5
//=
//8
//3+0+5=8。

#include <iostream>
#include <cstdio>
using namespace std;

int main()
{
    int n, count = 0;
    cin >> n;
    
    if(n < 0)
    {
        n *= -1;
    }
    while(n)
    {
        int m = n % 10;
        count += m;
        n = n / 10;
    }
    printf("%d\n", count);
    
    return 0;
}
