//2029：【例4.15】水仙花数
//
//时间限制: 1000 ms         内存限制: 65536 KB
//提交数:92277    通过数: 55733
//【题目描述】
//求100～999
//中的水仙花数。若三位数ABC
//，ABC=A3+B3+C3
//，则称ABC
//为水仙花数。
//
//例如153
//，13+53+33=1+125+27=153
//，则153
//是水仙花数。
//
//【输入】
//无
//
//【输出】
//由小到大输出满足条件的数，每个数占一行。
//
//假设需要输出两个数：119,100。需要输出以下形式：
//
//100
//
//119
//
//【输入样例】
//无
//【输出样例】
//无

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	for(int i = 100; i <= 999; i++)
	{
		int tmp = i;
		int ret = 0;
		while(tmp)
		{
			ret += pow(tmp % 10, 3);
			tmp /= 10;
		}
		if(ret == i)
			cout << i << endl;
	}
	
	return 0;
 } 
