//# P1162 填涂颜色
//
//## 题目描述
//
//由数字 $0$ 组成的方阵中，有一任意形状的由数字 $1$ 构成的闭合圈。现要求把闭合圈内的所有空间都填写成 $2$。例如：$6\times 6$ 的方阵（$n=6$），涂色前和涂色后的方阵如下：
//
//如果从某个 $0$ 出发，只向上下左右 $4$ 个方向移动且仅经过其他 $0$ 的情况下，无法到达方阵的边界，就认为这个 $0$ **在闭合圈内**。闭合圈不一定是环形的，可以是任意形状，但保证**闭合圈内**的 $0$ 是连通的（两两之间可以相互到达）。
//
//```plain
//0 0 0 0 0 0
//0 0 0 1 1 1
//0 1 1 0 0 1
//1 1 0 0 0 1
//1 0 0 1 0 1
//1 1 1 1 1 1
//```
//```plain
//0 0 0 0 0 0
//0 0 0 1 1 1
//0 1 1 2 2 1
//1 1 2 2 2 1
//1 2 2 1 2 1
//1 1 1 1 1 1
//```
//
//## 输入格式
//
//每组测试数据第一行一个整数 $n(1 \le n \le 30)$。
//
//接下来 $n$ 行，由 $0$ 和 $1$ 组成的 $n \times n$ 的方阵。
//
//方阵内只有一个闭合圈，圈内至少有一个 $0$。
//
//## 输出格式
//
//已经填好数字 $2$ 的完整方阵。
//
//## 输入输出样例 #1
//
//### 输入 #1
//
//```
//6
//0 0 0 0 0 0
//0 0 1 1 1 1
//0 1 1 0 0 1
//1 1 0 0 0 1
//1 0 0 0 0 1
//1 1 1 1 1 1
//```
//
//### 输出 #1
//
//```
//0 0 0 0 0 0
//0 0 1 1 1 1
//0 1 1 2 2 1
//1 1 2 2 2 1
//1 2 2 2 2 1
//1 1 1 1 1 1
//```
//
//## 说明/提示
//
//对于 $100\%$ 的数据，$1 \le n \le 30$。

//解法一：遍历第一行第一列，最后一行和最后一列
#include <iostream>
#include <queue>
#include <cstring>

using namespace std;

const int N = 35;

int n;
int g[N][N];
bool st[N][N];

int dx[4] = {0, 0, 1, -1};
int dy[4] = {1, -1, 0, 0};

//标记所有相连的0
void bfs(int i, int j)
{
    queue<pair<int ,int>> q;
    q.push({i, j});
    st[i][j] = true;

    while(q.size())
    {
        auto [a, b] = q.front();
        q.pop();

        for(int i = 0; i < 4; i++)
        {
            int x = a + dx[i], y = b + dy[i];
            if(x < 1 || x > n || y < 1 || y > n) continue;
            if(st[x][y] || g[x][y] == 1) continue;

            st[x][y] = true;
            q.push({x, y});
        }
    }
}

int main()
{
    while(cin >> n)
    {
        for(int i = 1; i <= n; i++)
        {
            for(int j = 1; j <= n; j++)
            {
                cin >> g[i][j];
            }
        }

        memset(st, 0, sizeof st);

        //把没有被包围的0标记一下
        for(int j = 1; j <= n; j++)
        {
            if(!g[1][j] && !st[1][j]) bfs(1, j);  //第一行
            if(!g[n][j] && !st[n][j]) bfs(n, j);  //第n行
        }

        for(int i = 1; i <= n; i++)
        {
            if(!g[i][1] && !st[i][1]) bfs(i, 1);  //第一列
            if(!g[i][n] && !st[i][n]) bfs(i, n);  //最后一列
        }

        //标记过的是0，没标记过的就是2
        for(int i = 1; i<= n; i++)
        {
            for(int j = 1; j <= n; j++)
            {
                if(g[i][j]) cout << g[i][j] << " ";
                else if(st[i][j]) cout << 0 << " ";
                else cout << 2 << " ";
            }
            cout << endl;
        }
    }

    return 0;
}
